elisp/GNU_Emacs_Lisp_Reference_Manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU Emacs Lisp Reference Manual 读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">GNU Emacs Lisp Reference Manual 读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc3a8c5">1. Introduction</a></li>
<li><a href="#orgee9ee4f">2. Lisp Data Types</a></li>
<li><a href="#org94e9a08">3. Numbers</a></li>
<li><a href="#orgf0e750c">4. Strings and Characters</a></li>
<li><a href="#orgebc3f94">5. Lists</a></li>
<li><a href="#orgabb95d5">6. Sequences Arrays Vectors</a></li>
<li><a href="#orgba14b08">7. Hash Tables</a></li>
<li><a href="#orgb30e0c4">8. Symbols</a></li>
<li><a href="#org9019002">9. Evaluation</a></li>
<li><a href="#orge72dc01">10. Control Structures</a></li>
<li><a href="#org11a34ea">11. Variables</a></li>
<li><a href="#org8a786f2">12. Functions</a></li>
<li><a href="#org96bc11a">13. Macros</a></li>
<li><a href="#org469d586">14. Customization</a></li>
<li><a href="#orgaffd2d6">15. Loading</a></li>
<li><a href="#orgc3c5008">16. Byte Compilation</a></li>
<li><a href="#orga4fbba0">17. Debugging</a></li>
<li><a href="#org861785b">18. Read and Print</a></li>
<li><a href="#orgfbaa22f">19. Minibuffers</a></li>
<li><a href="#orgebc00b4">20. Command Loop</a></li>
<li><a href="#org8520858">21. Keymaps</a></li>
<li><a href="#orgf0d8363">22. Modes</a></li>
<li><a href="#orgcd1c42e">23. Documentation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc3a8c5" class="outline-2">
<h2 id="orgbc3a8c5"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>elisp 中处理的是 elisp object。</li>
<li>lisp reader 是指将字面量转为 object 的程序，lisp writer 表示将 object 转为字面量的程序。</li>
<li>As far as the Lisp reader is concerned, ‘()’ and ‘nil’ are identical: they stand for the same object, the symbol nil。</li>
<li>nil and t are special symbols that always evaluate to themselves。</li>
<li>A Lisp expression that you can evaluate is called a form. Evaluating a form always produces a result, which is a Lisp object.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgee9ee4f" class="outline-2">
<h2 id="orgee9ee4f"><span class="section-number-2">2</span> Lisp Data Types</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Every object belongs to at least one type. Objects of the same type have similar structures and may usually be used in the same contexts. Types can overlap, and objects can belong to two or more types. Consequently, we can ask whether an object belongs to a particular type, but not for the type of an object.</li>
<li>Each object belongs to one and only one primitive type. These types include  <b>integer, float, cons, symbol, string, vector, hash-table, subr, and byte-code function, plus several special types</b> , such as buffer, that are related to editing</li>
<li>A Lisp variable can have any type of value, and it remembers whatever value you store in it, type and all.</li>
<li>In Lisp, an expression is primarily a Lisp object and only secondarily the text that is the object’s read syntax.</li>
<li>The ‘#@count’ construct, which skips the next count characters, is useful for program-generated comments containing binary data.</li>
<li>The usual read syntax for alphanumeric characters is a question mark followed by the character; thus, ‘?A’ for the character A,</li>
<li>A symbol in GNU Emacs Lisp is an object with a name. The symbol name serves as the printed representation of the symbol.a symbol’s name is unique—no two symbols have the same name.</li>
<li>Once an array is created, its length is fixed.</li>
<li></li>
</ul>
</div>
</div>

<div id="outline-container-org94e9a08" class="outline-2">
<h2 id="org94e9a08"><span class="section-number-2">3</span> Numbers</h2>
</div>
<div id="outline-container-orgf0e750c" class="outline-2">
<h2 id="orgf0e750c"><span class="section-number-2">4</span> Strings and Characters</h2>
</div>
<div id="outline-container-orgebc3f94" class="outline-2">
<h2 id="orgebc3f94"><span class="section-number-2">5</span> Lists</h2>
</div>
<div id="outline-container-orgabb95d5" class="outline-2">
<h2 id="orgabb95d5"><span class="section-number-2">6</span> Sequences Arrays Vectors</h2>
</div>
<div id="outline-container-orgba14b08" class="outline-2">
<h2 id="orgba14b08"><span class="section-number-2">7</span> Hash Tables</h2>
</div>
<div id="outline-container-orgb30e0c4" class="outline-2">
<h2 id="orgb30e0c4"><span class="section-number-2">8</span> Symbols</h2>
</div>
<div id="outline-container-org9019002" class="outline-2">
<h2 id="org9019002"><span class="section-number-2">9</span> Evaluation</h2>
</div>
<div id="outline-container-orge72dc01" class="outline-2">
<h2 id="orge72dc01"><span class="section-number-2">10</span> Control Structures</h2>
</div>
<div id="outline-container-org11a34ea" class="outline-2">
<h2 id="org11a34ea"><span class="section-number-2">11</span> Variables</h2>
</div>
<div id="outline-container-org8a786f2" class="outline-2">
<h2 id="org8a786f2"><span class="section-number-2">12</span> Functions</h2>
</div>
<div id="outline-container-org96bc11a" class="outline-2">
<h2 id="org96bc11a"><span class="section-number-2">13</span> Macros</h2>
</div>
<div id="outline-container-org469d586" class="outline-2">
<h2 id="org469d586"><span class="section-number-2">14</span> Customization</h2>
</div>
<div id="outline-container-orgaffd2d6" class="outline-2">
<h2 id="orgaffd2d6"><span class="section-number-2">15</span> Loading</h2>
</div>
<div id="outline-container-orgc3c5008" class="outline-2">
<h2 id="orgc3c5008"><span class="section-number-2">16</span> Byte Compilation</h2>
</div>
<div id="outline-container-orga4fbba0" class="outline-2">
<h2 id="orga4fbba0"><span class="section-number-2">17</span> Debugging</h2>
</div>
<div id="outline-container-org861785b" class="outline-2">
<h2 id="org861785b"><span class="section-number-2">18</span> Read and Print</h2>
</div>
<div id="outline-container-orgfbaa22f" class="outline-2">
<h2 id="orgfbaa22f"><span class="section-number-2">19</span> Minibuffers</h2>
</div>
<div id="outline-container-orgebc00b4" class="outline-2">
<h2 id="orgebc00b4"><span class="section-number-2">20</span> Command Loop</h2>
</div>
<div id="outline-container-org8520858" class="outline-2">
<h2 id="org8520858"><span class="section-number-2">21</span> Keymaps</h2>
</div>
<div id="outline-container-orgf0d8363" class="outline-2">
<h2 id="orgf0d8363"><span class="section-number-2">22</span> Modes</h2>
</div>
<div id="outline-container-orgcd1c42e" class="outline-2">
<h2 id="orgcd1c42e"><span class="section-number-2">23</span> Documentation</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
